{
	"initial area" : "my room",
	"game intro" : "[u]Welcome to ALYA![/u]\n\nYou are Alya, a girl about to embark on a journey for <insert plot here> reasons. In your travels, you'll meet people who might decide to follow you. Everyone has different strengths, and they won't always get along. It will be your job to decide who is the best fit for your party!\n\nThis is a text-based adventure. To play, type a command into the console and hit enter.\n\nType 'help' to see a list of available commands.\n\nIf you get stuck, look out for highlighted [u]key terms[/u] and try interacting with them!",
	"maps" : {
		"home" : {
			"name" : "Home",
			"areas" : [
				"my room",
				"downstairs"
			]
		}
	},
	"my room": {
		"name" : "My Room",
		"map" : "home",
		"intro" : "It's finally here!\n\nToday's the day you set off on your big adventure!\n\nYou wake up in your bedroom. It's the same as always: the south-facing [u]window[/u], the tidy [u]desk[/u], the elaborate [u]doll house[/u] in the corner.\n\nBut today, something is different. You can't put your finger on it, but the familiar comforts of your room seem somehow livelier than usual.\n\nIt's a great day for adventure!\n\n (!) HINT: Use 'examine <target>' to explore your room!",
		"description" : "Everything in your room is the same as always: the south-facing [u]window[/u], the tidy writing [u]desk[/u], the elaborate [u]doll house[/u] in the corner.",
		"poi" : {
			"window" : {
				"description" : "The morning sunlight warms your face as you peer out the window. You can see your family's apple orchard below... rows of budding trees stretching all the way to the surrounding forest.\n\nThe thought of apples makes your stomach rumble. What's for breakfast?"
			},
			"doll house" : {
				"description" : "You run your fingers along the tiny pine-wood shingles of the doll house roof. For years, your sister has been saying you'll grow out of it, but you never have. You still love placing each new piece of miniature furniture in one of the house's many rooms for your dolls to enjoy.\n\nYou can't wait to tell them about your latest adventures!"
			},
			"desk" : {
				"description" : "A stack of letters, all from Henry, takes permanent residence on the polished surface of your writing desk.\n\n (!) HINT: Use 'take <item>' to pick something up!",
				"items" : {
					"stitch-o-matic" : {
						"displayName" : "Stitch-o-Matic",
						"modifiers" : {
							"resources" : 1
						},
						"description" : "Henry's latest invention: a clockwork gadget that can mend small tears in fabric. Handy!",
						"beforePickup" : "There's something enclosed with Henry's latest letter, which reads: \"I hope you like my latest invention. I call it... the [u]Stitch-o-Matic[/u]! Just wind it up and let it rip! ...That is, [i]fix[/i] a rip. (It goes pretty fast, so be careful!)\""
					},
					"letter" : {
						"displayName" : "Letter",
						"description" : "A letter to Henry, sealed with a purple [i]A[/i]. Don't forget to post it!",
						"beforePickup" : "One of the [u]letters[/u] is your response to Henry. You should post it before you leave!"
					}
				}
			}
		}
	},
	"downstairs" : {
		"name" : "Downstairs",
		"map" : "home",
		"intro" : "You go downstairs. In the front hall, you're met with some wonderful aromas: freshly brewed coffee, sizzling pork, and baked cinnamon apples.\n\nYou follow your nose to the dining room, expecting to find your father, as usual.\n\nInstead, you're surprised and delighted to see your big sister, [u]Élodie[/u]! She's supposed to be off in Scary Big Forest, keeping the monsters at bay. What is she doing here?\n\n (!) HINT: Use 'talk (to) elodie' to speak with your sister!"
	}
}
